dk2ro/9cm_efm32/adc.c
#include "adc.h"

#include "em_adc.h"
#include "em_cmu.h"
#include "em_ldma.h"
#include "em_letimer.h"
#include "em_prs.h"


volatile uint32_t sample;
#define PRS_CHANNEL     0
#define LDMA_CHANNEL    0
#define LDMA_CH_MASK      (1 << LDMA_CHANNEL)
#define PP_BUFFER_SIZE 500

#define letimerDesired  1000

#define ADC_DVL         2

volatile uint8_t adc_ready = 0;
volatile uint8_t adc_buff = 0;

uint32_t pingBuffer[PP_BUFFER_SIZE];
uint32_t pongBuffer[PP_BUFFER_SIZE];

LDMA_Descriptor_t descLink[2];

void initLetimer(void) {
    // Start LFRCO and wait until it is stable
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);

    // Enable clock to the interface of the low energy modules
    CMU_ClockEnable(cmuClock_HFLE, true);

    // Route the LFRCO clock to LFA (TIMER0)
    CMU_ClockSelectSet(cmuClock_LFA, cmuSelect_LFRCO);

    // Enable clock for LETIMER0
    CMU_ClockEnable(cmuClock_LETIMER0, true);

    LETIMER_Init_TypeDef letimerInit = LETIMER_INIT_DEFAULT;

    // Reload COMP0 on underflow, pulse output, and run in repeat mode
    letimerInit.comp0Top = true;
    letimerInit.ufoa0 = letimerUFOAPulse;
    letimerInit.repMode = letimerRepeatFree;

    // Initialize LETIMER
    LETIMER_Init(LETIMER0, &letimerInit);

    // Need REP0 != 0 to pulse on underflow
    LETIMER_RepeatSet(LETIMER0, 0, 1);

    /// calculate the topValue
    uint32_t topValue = CMU_ClockFreqGet(cmuClock_LETIMER0) / letimerDesired;

    // Compare on wake-up interval count
    LETIMER_CompareSet(LETIMER0, 0, topValue);

    // Use LETIMER0 as async PRS to trigger ADC in EM2
    CMU_ClockEnable(cmuClock_PRS, true);

    PRS_SourceAsyncSignalSet(PRS_CHANNEL, PRS_CH_CTRL_SOURCESEL_LETIMER0,
                             PRS_CH_CTRL_SIGSEL_LETIMER0CH0);
}



LDMA_TransferCfg_t trans;
LDMA_Descriptor_t descr[2];

void initLdma(void) {
    // Enable CMU clock
    CMU_ClockEnable(cmuClock_LDMA, true);

    // Basic LDMA configuration
    LDMA_Init_t ldmaInit = LDMA_INIT_DEFAULT;

    LDMA_Init(&ldmaInit);

    // Transfers trigger off ADC single conversion complete
    trans = (LDMA_TransferCfg_t)LDMA_TRANSFER_CFG_PERIPHERAL(ldmaPeripheralSignal_ADC0_SINGLE);

    descr[0] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_LINKREL_P2M_WORD(
        &(ADC0->SINGLEDATA), // source
        pingBuffer, // destination
        PP_BUFFER_SIZE, // data transfer size
        1); // link relative offset (links to self)

    descr[1] = (LDMA_Descriptor_t)LDMA_DESCRIPTOR_LINKREL_P2M_WORD(
        &(ADC0->SINGLEDATA), // source
        pongBuffer, // destination
        PP_BUFFER_SIZE, // data transfer size
        -1);

    descr[0].xfer.blockSize = ADC_DVL - 1; // transfers ADC_DVL number of units per arbitration cycle
    descr[1].xfer.blockSize = ADC_DVL - 1; // transfers ADC_DVL number of units per arbitration cycle
    descr[0].xfer.ignoreSrec = true; // ignores single requests to save energy
    descr[1].xfer.ignoreSrec = true; // ignores single requests to save energy

    // Initialize transfer
    LDMA_StartTransfer(LDMA_CHANNEL, &trans, &descr[0]);

    // Clear pending and enable interrupts for LDMA
    NVIC_ClearPendingIRQ(LDMA_IRQn);
    NVIC_EnableIRQ(LDMA_IRQn);
    NVIC_SetPriority(LDMA_IRQn,1);
}

void adc_init() {
    CMU_ClockEnable(cmuClock_ADC0, true);
    CMU_ClockEnable(cmuClock_LDMA, true);

    // Declare init structs
    ADC_Init_TypeDef init = ADC_INIT_DEFAULT;
    ADC_InitSingle_TypeDef initSingle = ADC_INITSINGLE_DEFAULT;

    // Enable ADC clock
    CMU_ClockEnable(cmuClock_HFPER, true);
    CMU_ClockEnable(cmuClock_ADC0, true);

    // Select AUXHFRCO for ADC ASYNC mode so it can run in EM2
    CMU->ADCCTRL = CMU_ADCCTRL_ADC0CLKSEL_AUXHFRCO;

    // Set AUXHFRCO frequency and use it to setup the ADC
    CMU_AUXHFRCOBandSet(cmuAUXHFRCOFreq_4M0Hz);
    init.timebase = ADC_TimebaseCalc(CMU_AUXHFRCOBandGet());
    init.prescale = ADC_PrescaleCalc(ADC_FREQ, CMU_AUXHFRCOBandGet());

    // Let the ADC enable its clock in EM2 when necessary
    init.em2ClockConfig = adcEm2ClockOnDemand;
    // DMA is available in EM2 for processing SINGLEFIFO DVL request
    initSingle.singleDmaEm2Wu = 1;

    // Add external ADC input. See README for corresponding EXP header pin.
    initSingle.posSel = adcPosSelAPORT4XCH9;

    // Basic ADC single configuration
    initSingle.diff = false; // single-ended
    initSingle.reference = adcRef1V25; // 2.5V reference
    initSingle.resolution = adcRes12Bit; // 12-bit resolution
    initSingle.acqTime = adcAcqTime4; // set acquisition time to meet minimum requirements

    // Enable PRS trigger and select channel 0
    initSingle.prsEnable = true;
    initSingle.prsSel = (ADC_PRSSEL_TypeDef) PRS_CHANNEL;

    // Initialize ADC
    ADC_Init(ADC0, &init);
    ADC_InitSingle(ADC0, &initSingle);

    // Set single data valid level (DVL)
    ADC0->SINGLECTRLX = (ADC0->SINGLECTRLX & ~_ADC_SINGLECTRLX_DVL_MASK) | (
                            ((ADC_DVL - 1) << _ADC_SINGLECTRLX_DVL_SHIFT) & _ADC_SINGLECTRLX_DVL_MASK);

    // Clear the Single FIFO
    ADC0->SINGLEFIFOCLEAR = ADC_SINGLEFIFOCLEAR_SINGLEFIFOCLEAR;

    initLdma();
    initLetimer();
}

uint32_t* adc_get_data(uint32_t* len) {
    if (!adc_ready) {
        *len = 0;
        return NULL;
    }
    adc_ready = 0;
    *len = PP_BUFFER_SIZE;
    return adc_buff ? pongBuffer : pingBuffer;
}

/* Template for an LDMA IRQ handler. */
void LDMA_IRQHandler(void) {
    LDMA_IntClear((1 << LDMA_CHANNEL) << _LDMA_IFC_DONE_SHIFT);
    adc_ready = 1;
    adc_buff = (uint32_t *) (LDMA->CH[0].DST) == pingBuffer;
}
